Revit 2024 API
ColorOptions.GetColorOptions Method
 Returns the current Revit instance's ColorOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020.1
Syntax
C#
public static ColorOptions GetColorOptions()
Visual Basic
Public Shared Function GetColorOptions As ColorOptions
Visual C++
public:
static ColorOptions^ GetColorOptions()
Return Value
 The ColorOptions for the current Revit instance.
See Also
ColorOptions Class
Autodesk.Revit.DB Namespace